Revit 2026 API

# EnergyAnalysisSurfaceTilt Property

---

The tilt angle for this surface, in radians.

**Namespace:** Autodesk.Revit.DB.Analysis**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public double Tilt { get; }
```
```vb
Public ReadOnly Property Tilt As Double
	Get
```
```cpp
public:
property double Tilt {
	double get ();
}
```
```fsharp
member Tilt : float with get
```

#### Property Value

Double

The tilt is computed as the angle of rotation between the outward normal of the surface and the Z-axis.

#### Reference

EnergyAnalysisSurface Class

Autodesk.Revit.DB.Analysis Namespace